{
  "frases": [
    "El código es poesía. - WordPress",
    "Programa siempre como si la persona que mantendrá tu código fuera un psicópata violento que sabe dónde vives. - John Woods",
    "La simplicidad es la sofisticación definitiva. - Leonardo da Vinci",
    "Cualquier tonto puede escribir código que una computadora pueda entender. Los buenos programadores escriben código que los humanos pueden entender. - Martin Fowler",
    "Primero resuelve el problema. Luego, escribe el código. - John Johnson",
    "El hardware es lo que hace a una máquina rápida; el software es lo que hace que una máquina rápida se vuelva lenta. - Craig Bruce",
    "No temo a las computadoras. Temo a la falta de ellas. - Isaac Asimov",
    "Medir el progreso del desarrollo de software por líneas de código es como medir el progreso de la construcción de un avión por su peso. - Bill Gates",
    "El buen código es su mejor documentación. - Steve McConnell",
    "La función de un buen software es hacer que lo complejo aparente ser simple. - Grady Booch",
    "El debugging es el doble de difícil que escribir el código en primer lugar. Por lo tanto, si escribes el código lo más inteligentemente posible, por definición, no eres lo suficientemente inteligente para depurarlo. - Brian Kernighan",
    "La mayoría de los buenos programadores programan no porque esperan que les paguen o que el público los adore, sino porque programar es divertido. - Linus Torvalds",
    "Caminar sobre el agua y desarrollar software a partir de una especificación son fáciles si ambos están congelados. - Edward V. Berard",
    "Es difícil encontrar un error cuando lo estás buscando; es aún más difícil cuando asumes que el código está libre de errores. - Steve McConnell",
    "Si los constructores construyeran edificios de la misma manera que los programadores escriben programas, el primer pájaro carpintero que viniera destruiría la civilización. - Gerald Weinberg",
    "Hay dos formas de diseñar software: una es hacerlo tan simple que obviamente no haya deficiencias, y la otra es hacerlo tan complicado que no haya deficiencias obvias. - C.A.R. Hoare",
    "La programación no es sobre lo que sabes; es sobre lo que puedes averiguar. - Chris Pine",
    "El mejor método para predecir el futuro es implementarlo. - David Heinemeier Hansson",
    "La perfección se alcanza no cuando no hay nada más que añadir, sino cuando no hay nada más que quitar. - Antoine de Saint-Exupéry",
    "El código nunca miente, los comentarios a veces sí. - Ron Jeffries",
    "Un lenguaje de programación es de bajo nivel cuando requiere que prestes atención a lo irrelevante. - Alan J. Perlis",
    "A veces es mejor dejar que el código hable por sí mismo. - Autor desconocido",
    "La programación es el arte de decirle a otra persona lo que quieres que la computadora haga. - Donald Knuth",
    "La programación hoy es una carrera entre los ingenieros de software esforzándose por construir programas más grandes y mejores a prueba de idiotas, y el universo tratando de producir idiotas más grandes y mejores. Por ahora, el universo va ganando. - Rick Cook",
    "El arte de programar consiste en organizar y dominar la complejidad. - Edsger W. Dijkstra",
    "La primera regla de cualquier tecnología utilizada en una empresa es que la automatización aplicada a una operación eficiente magnificará la eficiencia. La segunda es que la automatización aplicada a una operación ineficiente magnificará la ineficiencia. - Bill Gates",
    "No me importa si funciona en tu máquina. No estoy enviando tu máquina. - Vidiu Platon",
    "Programar sin una arquitectura o diseño en mente es como explorar una gruta solo con una linterna: no sabes dónde estás, dónde has estado ni hacia dónde vas. - Danny Thorpe",
    "El mejor programa es el que ocupa menos espacio y realiza el trabajo en el menor tiempo posible. - Desconocido",
    "La única constante en el desarrollo de software es el cambio. - Autor desconocido"
  ]
}